export const metaDataMainPage = {
    title: "Вижу море",
    description: "Отель Вижу море в хуторе Бетта, предназначен для шикарного отдыха и приятных воспоминаний. Краснодарский край, Кабардинка, ул. Сухумское Шоссе , 1а,  +7-989-2430-60-80 для бронирования и обслуживания гостей.",
    keywords: [
        "Вижу море",
        "хутор Бетта",
        "Краснодарский край",
        "Черное море",
        "отель",
        "пляж",
        "жилье на море",
        "семейный отдых",
        "летний отдых",
        "комфортый отдых",
        "южное побережье России",
    ], // Ключевые слова, связанные с вашим отелем и местоположением
    openGraph: {
        title: 'Вижу море',
        description: 'Отель Вижу море в хуторе Бетта, предназначен для шикарного отдыха и приятных воспоминаний. Краснодарский край, Кабардинка, ул. Сухумское Шоссе , 1а,  +7-989-2430-60-80 для бронирования и обслуживания гостей.',
        url: 'https://vizhumore.ru', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://vizhumore.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Вижу море" в хуторе Бетта', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const mataDataHotelsPage = {
    title: "Все наши отели || Вижу море",
    description: "Выбирайте любой наш отель на Черном море в хуторе Бетта, Геленджике, Сочи. Забронируйте прямо сейчас! Телефон: +7-989-2430-60-80.",
    keywords: [
        "Вижу море",
        "хутор Бетта",
        "Геленджик",
        "Сочи",
        "Краснодарский край",
        "отель",
        "гостиница",
        "гостиницы сочи",
        "отели на черном море",
        "жилье на море",
        "жилье на черном море",
        "отдых на черном море",
        "кабардинка отдых",
        "геленджик отели",
        "южное побережье России",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Все наши отели || Вижу море',
        description: 'Выбирайте любой наш отель на Черном море в хуторе Бетта, Геленджике, Сочи. Забронируйте прямо сейчас! Телефон: +7-989-2430-60-80.',
        url: 'https://vizhumore.ru/hotels', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://vizhumore.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Вижу море" в хуторе Бетта', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataContactsPage = {
    title: "Контакты || Вижу море",
    description: "Контакты отеля Вижу море в хуторе Бетта. Краснодарский край, хутор Бетта,  +7-989-2430-60-80 для бронирования и обслуживания гостей.",
    keywords: [
        "Вижу море",
        "хутор Бетта",
        "Краснодарский край",
        "Черное море",
        "отель",
        "пляж",
        "жилье на море",
        "семейный отдых",
        "летний отдых",
        "комфортый отдых",
        "южное побережье России",
        "контакты",
        "номер телефона",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Контакты || Вижу море',
        description: 'Контакты отеля Вижу море в хуторе Бетта. Краснодарский край, хутор Бетта,  +7-989-2430-60-80 для бронирования и обслуживания гостей.',
        url: 'https://vizhumore.ru/contacts', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://vizhumore.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Вижу море" в хуторе Бетта', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataQuestionPage = {
    title: "Вопросы - ответы || Вижу море",
    description: "Вопросы - ответы отеля Вижу море в хуторе Бетта. Тут вы узнаете ответы на все часто заадаваемые вопросы.",
    keywords: [
        "Вижу море",
        "хутор Бетта",
        "Краснодарский край",
        "Черное море",
        "информация об отеле",
        "информация о пляже",
        "жилье на море",
        "семейный отдых",
        "летний отдых",
        "комфортый отдых",
        "южное побережье России",
        "контакты",
        "номер телефона",
        "вопрос-ответ"
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Вопрос-ответ || Вижу море',
        description: 'Вопросы - ответы отеля Шикарный вид в Кабардинке. Тут вы узнаете ответы на все часто заадаваемые вопросы.',
        url: 'https://vizhumore.ru/questionlist', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://vizhumore.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Вижу море" в хуторе Бетта', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataReservationAllPage = {
    title: "Бронирование || Вижу море",
    description: "Выбирайте и бронируйте номера на Черном море в наших отелях в хуторе Бетта, Сочи, Геленджике. Сравните цены, количество комнат и вместимость для идеального отдыха у моря.",
    keywords: [
        "Вижу море",
        "хутор Бетта",
        "Геленджик",
        "Сочи",
        "Краснодарский край",
        "бронирование отеля",
        "забронировать номер",
        "кабардинка номера",
        "Сочи номера",
        "Геленджик номера",
        "хутор Бетта отели",
        "Сочи отели",
        "Геленджик отели",
        "хутор Бетта отдых",
        "Сочи отдых",
        "Геленджик отдых",
        "хутор Бетта кабардинка",
        "хутор Бетта в кабардинке",
        "хутор Бетта жилье недорого",
        "хутор Бетта гостевые дома",
        "гостевые дома хуторе Бетта цены",
        "хутор Бетта снять жилье +у моря",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Бронирование || Вижу море',
        description: "Выбирайте и бронируйте номера на Черном море в наших отелях в хуторе Бетта, Сочи, Геленджике. Сравните цены, количество комнат и вместимость для идеального отдыха у моря.",
        url: 'https://vizhumore.ru/reservationall', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://vizhumore.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Вижу море" в хуторе Бетта', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataCurrentRoom = (id, getData) => {
    return {
        title: `${getData.currentApartments.nameApartment} || ${getData.currentHotel.nameHotel}`,
        description: `${getData.currentApartments.roomsDescription}`,
        keywords: [
            "Вижу море",
            "хутор Бетта",
            "Краснодарский край",
            "бронирование отеля",
            "забронировать номер",
            "кабардинка номера",
            "кабардинка отели",
            "отель кабардинка",
            "кабардинка отдых",
            "кабардинка номера",
            "жилье в кабардинке",
            "кабардинка жилье недорого",
            "кабардинка гостевые дома",
            "гостевые дома кабардинки цены",
            "кабардинка снять жилье +у моря",
            "отель номер удобства",
            "удобства +в номере",
        ], // Ключевые слова, связанные с вашим отелем и местоположением
        openGraph: {
            title: `${getData.currentApartments.nameApartment} || ${getData.currentHotel.nameHotel}`,
            description: `${getData.currentApartments.roomsDescription}`,
            url: `https://vizhumore.ru/${id}`, // Абсолютный URL вашей страницы
            images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
                {
                    url: 'https://vizhumore.ru/previeImg.jpg', // Абсолютный URL изображения
                    width: 1200,
                    height: 630,
                    alt: 'Отель "Вижу море" в хутор Бетта', // Альтернативный текст для изображения
                },
            ],
            locale: 'ru_RU', // Языковая локаль (русский, Россия)
            type: 'website', // Тип страницы (веб-сайт)
        },
        robots: {
            index: true, // Не индексировать страницу
            follow: true, // Следовать по ссылкам на странице
            googleBot: {
                index: true, // Индексировать содержимое страницы GoogleBot
                follow: true, // Не следовать по ссылкам GoogleBot
            },
            yandexBot: {
                index: true, // Индексировать содержимое страницы YandexBot
                follow: true, // Следовать по ссылкам YandexBot
            },
        },
    }
};

